[
  {
    "id": 1,
    "name": "Intro to Python",
    "description": "Create variables storing numbers, strings, and booleans",
    "generation_context": "This level teaches the absolute fundamentals: storing information in variables, getting input from users, displaying output with formatting, working with different data types, and making basic comparisons. Projects should feel like building simple interactive tools where users provide information and get personalized responses or calculations. Focus on practical, relatable scenarios like personal info collectors, simple calculators, unit converters, or quiz-style programs. The key is making users comfortable with the basic building blocks: variables, input/output, type conversion, and formatted strings.",
    "concepts": ["print", "variables", "input", "strings", "integers", "floats", "booleans", "comparisons", "f-strings", "type conversion"],
    "examples": ["print('Hello!')", "name = 'Alice'", "age = int(input('Age: '))", "score = 95.5", "is_valid = True", "age == 18", "f'Hello {name}!'", "int(), float(), str()"],
    "prerequisite_id": null
  },
  {
    "id": 2,
    "name": "Flow Control",
    "description": "Make decisions and repeat actions in your code",
    "generation_context": "This level introduces control flow: making decisions with conditionals and repeating actions with loops. Projects should involve branching logic (different outcomes based on conditions) and iteration (processing multiple items or repeating until a condition is met). Good projects include: decision-making apps (eligibility checkers, recommendation systems), counting/accumulation programs (score trackers, inventory counters), and menu-driven systems. Focus on practical scenarios where programs need to adapt behavior based on input and perform repetitive tasks efficiently.",
    "concepts": ["if statements", "else/elif", "comparison operators", "logical operators", "while loops", "for loops"],
    "examples": ["if age >= 18:", "else: print('no')", "==, !=, <, >, <=, >=", "and, or, not", "while count < 10:", "for i in range(5):"],
    "prerequisite_id": 1
  },
  {
    "id": 3,
    "name": "Lists",
    "description": "Work with collections of data",
    "generation_context": "This level introduces lists for managing collections of related data. Projects should involve building, modifying, and processing lists dynamically. Good projects include: to-do list managers, inventory systems, contact lists, shopping carts, playlist builders, or score trackers. Focus on practical scenarios where you need to store multiple items, add/remove entries, access specific positions, and iterate through collections. Projects should demonstrate why lists are essential for real-world data management.",
    "concepts": ["list creation", "indexing", "slicing", "append/insert", "remove/pop", "list iteration"],
    "examples": ["fruits = ['apple', 'banana']", "first = fruits[0]", "some = fruits[1:3]", "fruits.append('cherry')", "fruits.pop()", "for fruit in fruits:"],
    "prerequisite_id": 2
  },
  {
    "id": 4,
    "name": "Functions",
    "description": "Create reusable blocks of code",
    "generation_context": "This level teaches code organization and reusability through functions. Projects should break complex tasks into logical, reusable pieces. Good projects include: calculator suites (separate functions for different operations), text processors (functions for formatting, validation, transformation), game utilities (score calculation, validation rules), or data analysis tools (statistics functions, formatters). Focus on demonstrating how functions make code cleaner, more maintainable, and reusable. Projects should have multiple related functions working together toward a common goal.",
    "concepts": ["def keyword", "parameters", "return values", "default arguments", "scope"],
    "examples": ["def greet():", "def greet(name):", "return result", "def greet(name='World'):", "local vs global"],
    "prerequisite_id": 3
  },
  {
    "id": 5,
    "name": "Tuples, Dicts & Sets",
    "description": "More ways to organize data",
    "generation_context": "This level expands data structure knowledge with tuples (immutable sequences), dictionaries (key-value storage), and sets (unique collections). Projects should use these structures where they're most appropriate: dictionaries for structured data (user profiles, inventories with names/values, config settings), tuples for fixed data (coordinates, RGB colors, records), and sets for uniqueness operations (removing duplicates, membership testing). Good projects include: contact managers, product catalogs, student grade books, recipe databases, or systems that need fast lookups and data relationships.",
    "concepts": ["tuples", "dictionaries", "dict methods", "sets", "set operations"],
    "examples": ["point = (3, 4)", "person = {'name': 'Alice'}", ".keys(), .values(), .items()", "unique = {1, 2, 3}", "a | b, a & b"],
    "prerequisite_id": 4
  },
  {
    "id": 6,
    "name": "Modules & APIs",
    "description": "Use external code and connect to the world",
    "generation_context": "This level teaches using Python's module system and introduces API concepts. The curriculum progresses: basic imports (lessons 1-2), error handling with try/except (lessons 3-5), and API/request patterns (lessons 6-9). Projects should incorporate multiple modules working together with proper error handling. Good tier 2-3 projects simulate API workflows: parsing JSON data strings (like API responses), handling missing/invalid data gracefully, combining random data generation with JSON processing. Focus on building programs that feel like they're working with external data sources, even though actual network requests aren't possible in the sandbox. Use json.loads() to parse data, try/except to handle errors, and demonstrate real-world data processing patterns.",
    "concepts": ["import", "from import", "random module", "json module", "requests basics"],
    "examples": ["import math", "from math import sqrt", "random.randint(1, 10)", "json.loads(data)", "requests.get(url)"],
    "prerequisite_id": 5
  },
  {
    "id": 7,
    "name": "Strings & List Operations",
    "description": "Advanced text and list manipulation",
    "generation_context": "This level focuses on powerful string and list processing techniques. Projects should involve text processing, data cleaning, filtering, and transformation tasks. Good projects include: text analyzers (word counters, sentiment checkers), data processors (CSV-like data parsing, formatting), search/filter systems (finding items matching criteria), or content generators (template fillers, format converters). Use list comprehensions for elegant data transformation, string methods for text manipulation, and join/split for data format conversion. Focus on practical text and data processing scenarios that show the power of Python's built-in capabilities.",
    "concepts": ["string methods", "f-strings", "list comprehensions", "join/split", "sorting"],
    "examples": [".upper(), .split(), .strip()", "f'Hello, {name}!'", "[x*2 for x in range(5)]", "', '.join(items)", "sorted(items, key=len)"],
    "prerequisite_id": 6
  },
  {
    "id": 8,
    "name": "Object-Oriented Programming",
    "description": "Create your own data types with classes",
    "generation_context": "This level introduces object-oriented programming: creating custom classes to model real-world entities and their behaviors. Projects should define classes that represent things with both data (attributes) and actions (methods). Good projects include: game characters with stats and abilities, bank accounts with balance and transactions, library systems with books and members, or product inventories with items and operations. Use classes to encapsulate related data and behavior, demonstrate inheritance for shared functionality, and show how OOP makes code more organized and reusable. Focus on modeling real-world entities where objects have state and behavior.",
    "concepts": ["classes", "__init__", "self", "methods", "inheritance"],
    "examples": ["class Dog:", "def __init__(self, name):", "self.name = name", "def bark(self):", "class Puppy(Dog):"],
    "prerequisite_id": 7
  },
  {
    "id": 9,
    "name": "Working with Private APIs",
    "description": "Build real integrations with web services",
    "generation_context": "This level covers advanced API integration concepts: authentication, REST principles, robust error handling, pagination, and rate limiting. Since sandbox has no network access, projects should simulate complex API workflows with realistic patterns. Good projects include: multi-endpoint API clients (simulated with JSON data), authenticated service wrappers (header/token patterns), paginated data processors (iterating through result pages), or retry/rate-limit handlers. Focus on patterns used in real API integrations: handling auth tokens, processing paginated results, dealing with rate limits, parsing different response formats, and gracefully handling API errors.",
    "concepts": ["API authentication", "REST concepts", "error handling", "pagination", "rate limiting"],
    "examples": ["headers = {'Authorization': key}", "GET, POST, PUT, DELETE", "try/except, status codes", "while next_page:", "time.sleep(1)"],
    "prerequisite_id": 8
  }
]
